{"class_name": "Sequential", "keras_version": "2.2.3", "config": {"name": "sequential_1", "layers": [{"class_name": "ZeroPadding2D", "config": {"batch_input_shape": [1, 50, 50, 1], "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]], "name": "zero_padding2d_1", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv1_1", "bias_constraint": null, "kernel_size": [5, 5], "activation": "relu", "filters": 8, "activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv1_2", "bias_constraint": null, "kernel_size": [5, 5], "activation": "relu", "filters": 8, "activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2_1", "bias_constraint": null, "kernel_size": [5, 5], "activation": "relu", "filters": 16, "activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2_2", "bias_constraint": null, "kernel_size": [5, 5], "activation": "relu", "filters": 16, "activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [5, 5], "pool_size": [5, 5], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv3_1", "bias_constraint": null, "kernel_size": [5, 5], "activation": "relu", "filters": 40, "activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "data_format": "channels_last", "trainable": true, "padding": [[2, 2], [2, 2]]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv3_2", "bias_constraint": null, "kernel_size": [5, 5], "activation": "relu", "filters": 32, "activity_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.2, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "rate": 0.2, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "rate": 0.15, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "noise_shape": null, "rate": 0.1, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_4", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_5", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_6", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_7", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_8", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_9", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "sigmoid"}}]}, "backend": "tensorflow"}