{"class_name": "Sequential", "config": {"layers": [{"class_name": "ZeroPadding2D", "config": {"batch_input_shape": [1, 50, 50, 1], "name": "zero_padding2d_1", "trainable": true, "padding": [[2, 2], [2, 2]], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv1_1", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 8, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_2", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv1_2", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 8, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_3", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv2_1", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_4", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv2_2", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [5, 5], "padding": "valid", "pool_size": [5, 5], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_5", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv3_1", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 40, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_6", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv3_2", "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 32, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.15, "name": "dropout_3", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_4", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_5", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_6", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_7", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_8", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_9", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "sigmoid"}}], "name": "sequential_1"}, "keras_version": "2.2.3", "backend": "tensorflow"}